stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: Ramp up load
    - duration: 300
      arrivalRate: 500
      name: Sustained load (500 users/sec)
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Public User Flow"
    flow:
      - get:
          url: "/api/game/current"
      - get:
          url: "/api/prizes"
      - think: 5
      - get:
          url: "/api/game/current"